# WorkplaneShouldBeLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..WorkplaneShouldBeLevel Property
BuiltInFailures..::..RoofFailures Class See Also
---
Can't use Workplane that is not a Level. Set the desired Level as current Workplane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WorkplaneShouldBeLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WorkplaneShouldBeLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WorkplaneShouldBeLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace